sdaiCloseRepository(Sdai_instS*)
\details
Closes a specified repository.
\param repository [in] A pointer to a repository to be closed.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NEXS - Repository does not exist.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_RW - Transaction read - write.
* sdaiSY_ERR - Underlying system error.
\code
SdaiSession session = sdaiOpenSession();
SdaiRep repo = sdaiOpenRepositoryBN(session, "test_repository");
sdaiOpenRepository(session, repo);
...
sdaiCloseRepository(repo);